{
    "Personal Development": [
        "What are three things on your bucket list?",
        "What is the hardest life lesson to learn?",
        "Who is your inspiration?",
        "Have you ever been in therapy?",
        "What makes you truly happy?",
        "If you could change one core personality trait, what would it be?",
        "What's the last surprising thing you learned about yourself?",
        "How do you comfort yourself when you're upset?",
        "What's your biggest insecurity?",
        "What do you find unforgivable, if anything?",
        "Do you like to be alone?",
        "What negative self-talk do you struggle with?",
        "What are your biggest challenges right now?",
        "How do you deal with stress?",
        "What has made you feel ashamed?",
        "Do you think you're brave?",
        "What makes you feel vulnerable?",
        "If you could choose between living a long, ordinary life, or a short life filled with distinction, which would you choose?",
        "What's the most important lesson you took from a past relationship?",
        "What scares you the most?",
        "How do you actively try to achieve personal growth?",
        "What do you think about when you're alone?",
        "What have you learned about yourself this year?",
        "When was the last time you felt lost?",
        "If you could time travel, what is the one piece of advice you would give younger you?"
    ],
    "Relationships and Love": [
        "What do you value in a relationship?",
        "What are your favorite parts about my personality?",
        "What are your favorite parts of your personality?",
        "Do you believe in the institution of marriage?",
        "Do you think you are trustworthy?",
        "What do you consider cheating?",
        "Have you ever had your heart broken?",
        "How would you rank your love languages?",
        "How do you think we can keep our relationship exciting?",
        "What's the most important relationship in your life?",
        "What are the keys to a happy relationship?",
        "What is an absolute relationship deal breaker for you?",
        "Why do you think people cheat on their partners?"
    ],
    "Family and Background": [
        "What do your family know about me already?",
        "What do your friends know about me already?",
        "How close are you to your family members?",
        "How often do you see your family?",
        "What do your parents want for you in a partner?",
        "How important is your parent's approval to you?",
        "How welcoming has your family been to outsiders in the past?",
        "How open are you with your parents?",
        "What kind of place do you want to live in and why?",
        "What boundaries do you have with your family?",
        "What's your relationship to religion or spirituality?",
        "Are there any mental health issues or addiction struggles in your family?",
        "What's your earliest memory?",
        "Who was your first best friend, and what were they like?",
        "Who was your celebrity crush as a kid?"
    ],
    "Career and Aspirations": [
        "What's your dream job?",
        "What do you consider your greatest success?",
        "Where do you hope to be living in the next five years?",
        "Where do you see yourself in one year, three years, ten years?",
        "What is the greatest challenge you ever met in your career?",
        "What would you do if you knew you would not fail?",
        "If you could participate in one historical event, what would it be?",
        "Who do you trust completely?"
    ],
    "Fun and Leisure": [
        "What's one date we haven't gone on yet that you want to try?",
        "What would be your perfect day?",
        "What's your favorite time of day?",
        "What's the most incredible thing you've ever eaten?",
        "What's your dream vacation?",
        "What's your favorite band in high school? Now?",
        "What's a guilty pleasure of yours I don’t know about? Why do you love it?",
        "What was your happiest birthday ever like?",
        "What's your favorite childhood memory?",
        "What are the top three adventures you've had in your life?",
        "If you could have a junk food feast for an entire day, what would the menu be?",
        "Who are your favorite actor and actress? Why do you like them?",
        "What was your favorite TV show when you were little? Why did you love it?"
    ],
    "Intimate and Playful Moments": [
        "What's something new that you'd like to try in bed together?",
        "What's your greatest sexual fantasy?",
        "What's your favorite way to be kissed?",
        "What's a secret turn-on of yours?",
        "If we could plan the ultimate romantic weekend getaway, where would it be?",
        "What's your favorite part of foreplay?",
        "Is there a fantasy you’ve never shared with anyone?",
        "What’s your favorite outfit I wear that turns you on?",
        "Do you prefer spontaneous or planned intimate moments?",
        "What’s one way we could spice up our intimate life?",
        "What's the most exciting or daring place you've imagined being intimate?",
        "What's a type of roleplay or scenario you'd love to explore?",
        "What is something small I do that turns you on instantly?",
        "If we could spend an entire day in bed together, what would we do?",
        "How do you feel about exploring new things sexually?"
    ]
}

